// ---1---

// Перепишіть функцію, використовуючи '?' або '||'

// function checkAge(age) {
// 	return age > 18 ? true : confirm("Батьки дозволили?");
// }

// ---2---

// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.

// let min = (a, b) => {
// 	return Math.min(a, b);
// };

// ---3---

// Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:

// let ask = (question, yes, no) => {
// 	if (confirm(question)) yes();
// 	else no();
// };

// ask(
// 	"Ви згодні?",
// 	() => {
// 		alert("Ви погодились.");
// 	},
// 	() => {
// 		alert("Ви скасували виконання.");
// 	}
// );
