function AboutPage() {
    return (
        <div style={{ paddingLeft: '13px' }}>
            <h2>Кому підійде ця програма?</h2>
            <p>
                Якщо, ви не писали ручкою 1000 років, і ваш почерк став, як у
                лікарів - вам сюди.
            </p>
            <h2>Як це працює?</h2>
            <p>
                Цей застосунок допоможе вам зробити свої завдання набагато
                цікавіше.
            </p>
            <p>
                Він працює апсолютно одинаково, як ви пишете свої справи на
                бумазі. Але тут є одна перевага. Ви маєте змогу дивитися тільки
                зроблені задачі, активні та все заразом.
            </p>
            <h2>Про розробку додатка</h2>
            <p>
                Цей додаток зроблений з допомогою{' '}
                <span style={{ color: '#00f' }}>бібліотеки React</span>.{' '}
            </p>
            <h2>5 фактів про розробника</h2>
            <ul style={{ listStyleType: 'disc ', padding: '20px' }}>
                <li>
                    Ім'я <span style={{ color: '#0f0' }}>Потебенько Роман</span>
                </li>
                <li>
                    Псевдонім <span style={{ color: '#0f0' }}>RomahomaN9</span>
                </li>
                <li>
                    Вік <span style={{ color: '#0f0' }}>12 років</span>
                </li>
                <li>
                    Проживає в <span style={{ color: '#0f0' }}>Україні</span>
                </li>
                <li>
                    Досвіт в програмуванні{' '}
                    <span style={{ color: '#0f0' }}>3 роки</span>
                </li>
            </ul>
        </div>
    );
}

export default AboutPage;
