import { Link } from 'react-router-dom';

function HomePage() {
    return (
        <div style={{ paddingLeft: '13px' }}>
            <h2>Кому підійде ця програма?</h2>
            <p>
                Якщо, ви не писали ручкою 1000 років, і ваш почерк став, як у
                лікарів - вам сюди.
            </p>
            <h2>Як це працює?</h2>
            <p>
                Цей застосунок допоможе вам зробити свої завдання набагато
                цікавіше.
            </p>
            <p>
                Він працює апсолютно одинаково, як ви пишете свої справи на
                бумазі. Але тут є одна перевага. Ви маєте змогу дивитися тільки
                зроблені задачі, активні та все заразом.
            </p>
            <Link to="/todo-list" className="home-button">
                Розпочати
            </Link>
        </div>
    );
}

export default HomePage;
